w6/w6d3/first_routes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "mark"], ["email", "m@ark.com"]]
---
    def create
        #render json: params
        user = User.new(params.require(:user).permit(:name, :email))
        if user.save